"""
1736. 替换隐藏数字得到的最晚时间
1736. 替换隐藏数字得到的最晚时间
给你一个字符串 time ，格式为 hh:mm（小时：分钟），其中某几位数字被隐藏（用 ? 表示）。

有效的时间为 00:00 到 23:59 之间的所有时间，包括 00:00 和 23:59 。

替换 time 中隐藏的数字，返回你可以得到的最晚有效时间。



示例 1：

输入：time = "2?:?0"
输出："23:50"
解释：以数字 '2' 开头的最晚一小时是 23 ，以 '0' 结尾的最晚一分钟是 50 。
示例 2：

输入：time = "0?:3?"
输出："09:39"
示例 3：

输入：time = "1?:22"
输出："19:22"


提示：

time 的格式为 hh:mm
题目数据保证你可以由输入的字符串生成有效的时间
"""


class Solution:
    def maximumTime(self, time: str) -> str:
        tt = ''
        max_time = {
            "??": "2",
            "?0": "2",
            "?1": "2",
            "?2": "2",
            "?3": "2",
            "?4": "1",
            "?5": "1",
            "?6": "1",
            "?7": "1",
            "?8": "1",
            "?9": "1",

            "0?": "9",
            "1?": "9",
            "2?": "3",

            3: "5",
            4: "9"
        }

        for i, t in enumerate(time):

            if t == '?':

                if i == 0:
                    t = max_time[f"?{time[1]}"]
                elif i == 1:
                    t = max_time[f"{tt[0]}?"]
                else:
                    t = max_time[i]

            tt += t

        return tt


if __name__ == '__main__':
    S = Solution()
    time_list = ["?4:03", "2?:?0", "0?:3?", "1?:22", "00:01"]
    for x in time_list:
        print(S.maximumTime(x))
